---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.CurveFromPickedFailed
source: html/574a320f-4615-d181-6aa0-b9ff25f8046d.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.CurveFromPickedFailed Property

Can't create boundary from pick.

## Syntax (C#)
```csharp
public static FailureDefinitionId CurveFromPickedFailed { get; }
```